# ContourElevationStep Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContourElevationStep Property
ParameterTypeId Class See Also
---
"Increment"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContourElevationStep { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContourElevationStep As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContourElevationStep {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace